
while True: # Цикл буде нескінченним, поки ми його не зупинимо вручну
    password = input("Введіть пароль: ")
    if password == "12345":
        print("Доступ дозволено!")
        break # Виходимо з циклу
    else:
        print("Неправильно. Спробуйте ще раз.")

# приклад на скінченному списку

    correct_password = "qwerty"
    attempts_left = 3  # Кількість спроб, яка є у користувача

    # Цикл працює, ПОКИ у користувача є хоча б одна спроба
    while attempts_left > 0:
        password = input(f"Введіть пароль (залишилось спроб: {attempts_left}): ")

        if password == correct_password:
            print("Вхід успішний! Ласкаво просимо.")
            break  # Пароль правильний, зупиняємо цикл передчасно
        else:
            print("Неправильний пароль.")
            attempts_left -= 1  # Зменшуємо кількість спроб на 1

    # Цей код виконається, тільки якщо цикл завершився (спроби вичерпалися або був break)
    if attempts_left == 0:
        print("Доступ заблоковано! Ви вичерпали всі спроби.")