# Функції "До і після ф-ї потрібно пропустити 2 рядки обов'язково.
#Якщо в кінці функціїї нічого не вказано. Вона по замовчуванню повертає None:
# тобто, return None


def calculate(a, b, c):
    d = ((a + b) * 2) / (c - 50)
    if d > 10:
        d += 10
    elif d < 10:
        d += 100
    print(d)
    #return d  # ф-я припиняє своє виконання і повертає значення що ми поставим наприклад d
    #Повертає завжди лиже 1 значення



... #якийсь код
a = 34
b = 12
c = 56
#d = ((a + b) * 2) / (c - 50)
#if d > 10:
#    d += 10
#elif d < 10:
#    d += 100
#print(d)
calculate(a, b, c)
... #якийсь код
# result = ((23 + 12) * 2) / (c - 50)
# if result > 10:
#     result += 10
# elif result < 10:
#     result += 100
# print(result)
calculate(23, 12, c)
... #якийсь код
z = 10
f = 45
r = 55
calculate(z, f, r)
# w = ((z + f) * 2) / (r - 50)
# if w > 10:
#     w += 10
# elif w < 10:
#     w += 100
# print(w)
